1) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Candidate.php:11    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
 class Candidate extends Model
 {
     protected $fillable = ['name', 'lastname', 'email', 'promotion_id', 'phone_number', 'status', 'soloLearn', 'codeAcademy'];
-    protected function promotion()
+    private function promotion()
     {
         return $this->belongsTo(Promotion::class);
     }
 }

4) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:40    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         Promotion::create($request->all());
         return redirect()->route('promotion.index')->with('success', 'Registro creado satisfactoriamente');
     }
-    protected function show(Promotion $promotion)
+    private function show(Promotion $promotion)
     {
         return view('promotion.show', compact('promotion'));
     }

5) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Promotion.php:11    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
 class Promotion extends Model
 {
     protected $fillable = ['name'];
-    protected function candidates()
+    private function candidates()
     {
         return $this->hasMany(Candidate::class);
     }
 }

7) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Providers/EventServiceProvider.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function boot()
     {
-        parent::boot();
+        
         //
     }
 }

8) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Providers/RouteServiceProvider.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function map()
     {
-        $this->mapApiRoutes();
+        
         $this->mapWebRoutes();
         //
     }

9) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Providers/RouteServiceProvider.php:59    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      *
      * @return void
      */
-    protected function mapWebRoutes()
+    private function mapWebRoutes()
     {
         Route::middleware('web')->namespace($this->namespace)->group(base_path('routes/web.php'));
     }

10) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Providers/RouteServiceProvider.php:73    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      *
      * @return void
      */
-    protected function mapApiRoutes()
+    private function mapApiRoutes()
     {
         Route::prefix('api')->middleware('api')->namespace($this->namespace)->group(base_path('routes/api.php'));
     }
 }

11) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Providers/RouteServiceProvider.php:75    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     protected function mapApiRoutes()
     {
-        Route::prefix('api')->middleware('api')->namespace($this->namespace)->group(base_path('routes/api.php'));
+        
     }
 }


Timed Out mutants:
==================

Not Covered mutants:
====================

14) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:13    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
 use App\Promotion;
 class CandidateController extends Controller
 {
-    protected function index()
+    private function index()
     {
         $candidates = Candidate::orderBy('status', 'ASC')->paginate(15);
         return view('candidate.index', compact('candidates'));

15) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:15    [M] DecrementInteger

--- Original
+++ New
@@ @@
 {
     protected function index()
     {
-        $candidates = Candidate::orderBy('status', 'ASC')->paginate(15);
+        $candidates = Candidate::orderBy('status', 'ASC')->paginate(14);
         return view('candidate.index', compact('candidates'));
     }
     protected function create()

16) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:15    [M] IncrementInteger

--- Original
+++ New
@@ @@
 {
     protected function index()
     {
-        $candidates = Candidate::orderBy('status', 'ASC')->paginate(15);
+        $candidates = Candidate::orderBy('status', 'ASC')->paginate(16);
         return view('candidate.index', compact('candidates'));
     }
     protected function create()

17) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:17    [M] FunctionCall

--- Original
+++ New
@@ @@
     protected function index()
     {
         $candidates = Candidate::orderBy('status', 'ASC')->paginate(15);
-        return view('candidate.index', compact('candidates'));
+        view('candidate.index', compact('candidates'));
+        return null;
     }
     protected function create()
     {

18) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:21    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         $candidates = Candidate::orderBy('status', 'ASC')->paginate(15);
         return view('candidate.index', compact('candidates'));
     }
-    protected function create()
+    private function create()
     {
         $promotions = Promotion::all();
         return view('candidate.create', compact('promotions'));

19) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:26    [M] FunctionCall

--- Original
+++ New
@@ @@
     protected function create()
     {
         $promotions = Promotion::all();
-        return view('candidate.create', compact('promotions'));
+        view('candidate.create', compact('promotions'));
+        return null;
     }
     protected function store(Request $request)
     {

20) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:30    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         $promotions = Promotion::all();
         return view('candidate.create', compact('promotions'));
     }
-    protected function store(Request $request)
+    private function store(Request $request)
     {
         $this->validate($request, ['name' => 'required', 'lastname' => 'required', 'email' => 'required']);
         Candidate::create($request->all());

21) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     protected function store(Request $request)
     {
-        $this->validate($request, ['name' => 'required', 'lastname' => 'required', 'email' => 'required']);
+        $this->validate($request, ['lastname' => 'required', 'email' => 'required']);
         Candidate::create($request->all());
         return redirect()->route('candidate.index')->with('success', 'Registro creado satisfactoriamente');
     }

22) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function store(Request $request)
     {
-        $this->validate($request, ['name' => 'required', 'lastname' => 'required', 'email' => 'required']);
+        
         Candidate::create($request->all());
         return redirect()->route('candidate.index')->with('success', 'Registro creado satisfactoriamente');
     }

23) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function store(Request $request)
     {
         $this->validate($request, ['name' => 'required', 'lastname' => 'required', 'email' => 'required']);
-        Candidate::create($request->all());
+        
         return redirect()->route('candidate.index')->with('success', 'Registro creado satisfactoriamente');
     }
     protected function show($id)

24) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:42    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         Candidate::create($request->all());
         return redirect()->route('candidate.index')->with('success', 'Registro creado satisfactoriamente');
     }
-    protected function show($id)
+    private function show($id)
     {
         $candidate = Candidate::find($id);
         return view('candidate.perfil', compact('candidate'));

25) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:47    [M] FunctionCall

--- Original
+++ New
@@ @@
     protected function show($id)
     {
         $candidate = Candidate::find($id);
-        return view('candidate.perfil', compact('candidate'));
+        view('candidate.perfil', compact('candidate'));
+        return null;
     }
     protected function edit($id)
     {

26) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:50    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         $candidate = Candidate::find($id);
         return view('candidate.perfil', compact('candidate'));
     }
-    protected function edit($id)
+    private function edit($id)
     {
         $candidate = Candidate::find($id);
         $promotions = Promotion::all();

27) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:56    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $candidate = Candidate::find($id);
         $promotions = Promotion::all();
-        return view('candidate.edit', compact('candidate', 'promotions'));
+        view('candidate.edit', compact('candidate', 'promotions'));
+        return null;
     }
     public function update(Request $request, $id)
     {

28) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $promotions = Promotion::all();
         return view('candidate.edit', compact('candidate', 'promotions'));
     }
-    public function update(Request $request, $id)
+    protected function update(Request $request, $id)
     {
         $this->validate($request, ['name' => 'required', 'lastname' => 'required', 'email' => 'required']);
         Candidate::find($id)->update($request->all());

31) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function update(Request $request, $id)
     {
         $this->validate($request, ['name' => 'required', 'lastname' => 'required', 'email' => 'required']);
-        Candidate::find($id)->update($request->all());
+        
         return redirect()->route('candidate.index')->with('success', 'Registro actualizado satisfactoriamente');
     }
     public function destroy($id)

32) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:69    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Candidate::find($id)->update($request->all());
         return redirect()->route('candidate.index')->with('success', 'Registro actualizado satisfactoriamente');
     }
-    public function destroy($id)
+    protected function destroy($id)
     {
         Candidate::find($id)->delete();
         return redirect()->route('candidate.index')->with('success', 'Registro eliminado satisfactoriamente');
     }
 }

33) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:71    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function destroy($id)
     {
-        Candidate::find($id)->delete();
+        
         return redirect()->route('candidate.index')->with('success', 'Registro eliminado satisfactoriamente');
     }
 }

34) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CourseController.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return \Illuminate\Http\Response
      */
-    public function index()
+    protected function index()
     {
         //
     }

35) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CourseController.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return \Illuminate\Http\Response
      */
-    public function create()
+    protected function create()
     {
         //
     }

36) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CourseController.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param  \Illuminate\Http\Request  $request
      * @return \Illuminate\Http\Response
      */
-    public function store(Request $request)
+    protected function store(Request $request)
     {
         //
     }

37) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CourseController.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param  \App\Course  $course
      * @return \Illuminate\Http\Response
      */
-    public function show(Course $course)
+    protected function show(Course $course)
     {
         //
     }

38) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CourseController.php:58    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param  \App\Course  $course
      * @return \Illuminate\Http\Response
      */
-    public function edit(Course $course)
+    protected function edit(Course $course)
     {
         //
     }

39) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CourseController.php:70    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param  \App\Course  $course
      * @return \Illuminate\Http\Response
      */
-    public function update(Request $request, Course $course)
+    protected function update(Request $request, Course $course)
     {
         //
     }

40) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CourseController.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param  \App\Course  $course
      * @return \Illuminate\Http\Response
      */
-    public function destroy(Course $course)
+    protected function destroy(Course $course)
     {
         //
     }
 }

41) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/HomeController.php:11    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct()
     {
-        $this->middleware('auth');
+        
     }
     public function index()
     {

42) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/HomeController.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->middleware('auth');
     }
-    public function index()
+    protected function index()
     {
         return view('home');
     }
 }

43) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/HomeController.php:16    [M] FunctionCall

--- Original
+++ New
@@ @@
     }
     public function index()
     {
-        return view('home');
+        view('home');
+        return null;
     }
 }

47) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/ProgressController.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param  \App\Progress  $progress
      * @return \Illuminate\Http\Response
      */
-    public function show(Progress $progress)
+    protected function show(Progress $progress)
     {
         //
     }

48) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/ProgressController.php:58    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param  \App\Progress  $progress
      * @return \Illuminate\Http\Response
      */
-    public function edit(Progress $progress)
+    protected function edit(Progress $progress)
     {
         //
     }

49) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/ProgressController.php:70    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param  \App\Progress  $progress
      * @return \Illuminate\Http\Response
      */
-    public function update(Request $request, Progress $progress)
+    protected function update(Request $request, Progress $progress)
     {
         //
     }

50) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/ProgressController.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param  \App\Progress  $progress
      * @return \Illuminate\Http\Response
      */
-    public function destroy(Progress $progress)
+    protected function destroy(Progress $progress)
     {
         //
     }
 }

51) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use App\Promotion;
 class PromotionController extends Controller
 {
-    public function index()
+    protected function index()
     {
         $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(15);
         return view('promotion.index', compact('promotions'));

52) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:16    [M] DecrementInteger

--- Original
+++ New
@@ @@
 {
     public function index()
     {
-        $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(15);
+        $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(14);
         return view('promotion.index', compact('promotions'));
     }
     public function create()

53) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:16    [M] IncrementInteger

--- Original
+++ New
@@ @@
 {
     public function index()
     {
-        $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(15);
+        $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(16);
         return view('promotion.index', compact('promotions'));
     }
     public function create()

54) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:18    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function index()
     {
         $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(15);
-        return view('promotion.index', compact('promotions'));
+        view('promotion.index', compact('promotions'));
+        return null;
     }
     public function create()
     {

55) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(15);
         return view('promotion.index', compact('promotions'));
     }
-    public function create()
+    protected function create()
     {
         return view('promotion.create');
     }

56) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:24    [M] FunctionCall

--- Original
+++ New
@@ @@
     }
     public function create()
     {
-        return view('promotion.create');
+        view('promotion.create');
+        return null;
     }
     public function store(Request $request)
     {

57) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:28    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return view('promotion.create');
     }
-    public function store(Request $request)
+    protected function store(Request $request)
     {
         $this->validate($request, ['name' => 'required']);
         Promotion::create($request->all());

58) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function store(Request $request)
     {
-        $this->validate($request, ['name' => 'required']);
+        
         Promotion::create($request->all());
         return redirect()->route('promotion.index')->with('success', 'Registro creado satisfactoriamente');
     }

59) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:30    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function store(Request $request)
     {
-        $this->validate($request, ['name' => 'required']);
+        $this->validate($request, []);
         Promotion::create($request->all());
         return redirect()->route('promotion.index')->with('success', 'Registro creado satisfactoriamente');
     }

60) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function store(Request $request)
     {
         $this->validate($request, ['name' => 'required']);
-        Promotion::create($request->all());
+        
         return redirect()->route('promotion.index')->with('success', 'Registro creado satisfactoriamente');
     }
     protected function show(Promotion $promotion)

61) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:45    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return view('promotion.show', compact('promotion'));
     }
-    public function edit($id)
+    protected function edit($id)
     {
         $promotion = Promotion::find($id);
         return view('promotion.edit', compact('promotion'));

62) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:50    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function edit($id)
     {
         $promotion = Promotion::find($id);
-        return view('promotion.edit', compact('promotion'));
+        view('promotion.edit', compact('promotion'));
+        return null;
     }
     public function update(Request $request, $id)
     {

66) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function update(Request $request, $id)
     {
         $this->validate($request, ['name' => 'required']);
-        Promotion::find($id)->update($request->all());
+        
         return redirect()->route('promotion.index')->with('success', 'Registro actualizado satisfactoriamente');
     }
     public function destroy($id)

68) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function destroy($id)
     {
-        Promotion::find($id)->delete();
+        
         return redirect()->route('promotion.index')->with('success', 'Registro eliminado satisfactoriamente');
     }
 }

69) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/ScrapingController.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use App\WebScrapping;
 class ScrapingController extends Controller
 {
-    public function getSoloLearnData()
+    protected function getSoloLearnData()
     {
         $courseData = [];
         $webScrapper = new WebScrapping();

70) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/ScrapingController.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             #string
             $courseExperience = $courseNode->filter('p')->text();
             #string
-            array_push($courseData, [$courseTitle, $coursePercentage, $courseExperience]);
+            array_push($courseData, [$coursePercentage, $courseExperience]);
         });
         return $courseData;
     }
 }

71) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/ScrapingController.php:22    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             $coursePercentage = $courseNode->filter('div[class="chart"]')->attr('data-percent');
             #string
             $courseExperience = $courseNode->filter('p')->text();
-            #string
-            array_push($courseData, [$courseTitle, $coursePercentage, $courseExperience]);
+            
         });
         return $courseData;
     }
 }

74) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Middleware/RedirectIfAuthenticated.php:19    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param  string|null  $guard
      * @return mixed
      */
-    public function handle($request, Closure $next, $guard = null)
+    protected function handle($request, Closure $next, $guard = null)
     {
         if (Auth::guard($guard)->check()) {
             return redirect(RouteServiceProvider::HOME);

75) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Middleware/RedirectIfAuthenticated.php:22    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function handle($request, Closure $next, $guard = null)
     {
         if (Auth::guard($guard)->check()) {
-            return redirect(RouteServiceProvider::HOME);
+            redirect(RouteServiceProvider::HOME);
+            return null;
         }
         return $next($request);
     }
 }

76) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Middleware/RedirectIfAuthenticated.php:25    [M] FunctionCall

--- Original
+++ New
@@ @@
         if (Auth::guard($guard)->check()) {
             return redirect(RouteServiceProvider::HOME);
         }
-        return $next($request);
+        $next($request);
+        return null;
     }
 }

77) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Middleware/TrustHosts.php:16    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function hosts()
     {
-        return [$this->allSubdomainsOfApplicationUrl()];
+        return [];
     }
 }

79) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Providers/BroadcastServiceProvider.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function boot()
     {
-        Broadcast::routes();
+        
         require base_path('routes/channels.php');
     }
 }
