1) /Users/diegon/Desktop/Backend/code_talent_prueba/app/CodeAcademyScraping.php:50    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     {
         $json_course = fopen('HTML_CSS_course.json', 'w');
         fwrite($json_course, json_encode($html_and_css_courses));
-        fclose($json_course);
+        
         return $json_course;
     }
 }

5) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Providers/RouteServiceProvider.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function boot()
     {
-        //
-        parent::boot();
+        
     }
     /**
      * Define the routes for the application.

7) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Providers/RouteServiceProvider.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function map()
     {
         $this->mapApiRoutes();
-        $this->mapWebRoutes();
+        
         //
     }
     /**

9) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Providers/RouteServiceProvider.php:61    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     protected function mapWebRoutes()
     {
-        Route::middleware('web')->namespace($this->namespace)->group(base_path('routes/web.php'));
+        
     }
     /**
      * Define the "api" routes for the application.

12) /Users/diegon/Desktop/Backend/code_talent_prueba/app/SoloLearnScraping.php:44    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     {
         $json_course = fopen('PHP_course.json', 'w');
         fwrite($json_course, json_encode($get_PHP_course));
-        fclose($json_course);
+        
         return $json_course;
     }
 }

13) /Users/diegon/Desktop/Backend/code_talent_prueba/app/WebScraping.php:9    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Goutte\Client;
 class WebScraping
 {
-    public function scrap(string $url)
+    protected function scrap(string $url)
     {
         $client = new Client();
         $crawler = $client->request('GET', $url);


Timed Out mutants:
==================

Not Covered mutants:
====================

1) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Candidate.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class Candidate extends Model
 {
     protected $fillable = ['name', 'lastname', 'email', 'promotion', 'phone_number', 'status', 'soloLearn', 'codeAcademy'];
-    public function promotion()
+    protected function promotion()
     {
         return $this->hasMany(Promotion::class);
     }
 }

21) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:22    [M] FunctionCall

--- Original
+++ New
@@ @@
     }
     public function create()
     {
-        return view('candidate.create');
+        view('candidate.create');
+        return null;
     }
     public function store(Request $request)
     {

26) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Candidate::create($request->all());
         return redirect()->route('candidate.index')->with('success', 'Registro creado satisfactoriamente');
     }
-    public function show($id)
+    protected function show($id)
     {
         $candidate = Candidate::find($id);
         return view('candidate.perfil', compact('candidate'));

29) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/CandidateController.php:51    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function edit($id)
     {
         $candidate = Candidate::find($id);
-        return view('candidate.edit', compact('candidate'));
+        view('candidate.edit', compact('candidate'));
+        return null;
     }
     public function update(Request $request, $id)
     {

46) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function store(Request $request)
     {
-        $this->validate($request, ['name' => 'required', 'promotion' => 'required']);
+        $this->validate($request, ['promotion' => 'required']);
         Promotion::create($request->all());
         return redirect()->route('promotion.index')->with('success', 'Registro creado satisfactoriamente');
     }

47) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function store(Request $request)
     {
-        $this->validate($request, ['name' => 'required', 'promotion' => 'required']);
+        
         Promotion::create($request->all());
         return redirect()->route('promotion.index')->with('success', 'Registro creado satisfactoriamente');
     }

48) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function store(Request $request)
     {
         $this->validate($request, ['name' => 'required', 'promotion' => 'required']);
-        Promotion::create($request->all());
+        
         return redirect()->route('promotion.index')->with('success', 'Registro creado satisfactoriamente');
     }
     public function show($id)

50) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:43    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function show($id)
     {
         $promotion = Promotion::find($id);
-        return view('promotion.index', compact('promotion'));
+        view('promotion.index', compact('promotion'));
+        return null;
     }
     public function edit($id)
     {

56) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Http/Controllers/PromotionController.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function update(Request $request, $id)
     {
         $this->validate($request, ['name' => 'required', 'promotion' => 'required']);
-        Promotion::find($id)->update($request->all());
+        
         return redirect()->route('promotion.index')->with('success', 'Registro actualizado satisfactoriamente');
     }
     public function destroy($id)

68) /Users/diegon/Desktop/Backend/code_talent_prueba/app/Promotion.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class Promotion extends Model
 {
     protected $fillable = ['name', 'promotion'];
-    public function candidate()
+    protected function candidate()
     {
         return $this->belongsTo(Candidate::class);
     }
 }

71) /Users/diegon/Desktop/Backend/code_talent_prueba/app/SoloLearnScraping.php:36    [M] FalseValue

--- Original
+++ New
@@ @@
                 return $course;
             }
         }
-        return False;
+        return true;
     }
     public function get_json_data($get_PHP_course)
     {
